In [1]:
import pandas as pd
df=pd.read_csv('imp.csv')
df.head()

   area  Bedrooms  age  price  pred_value
0   900         2   10   2500  2507.92393
1  2000         4    5   9500         NaN
2  1400         3   20   5200         NaN
3  2100         5   10   9500         NaN
4  1200         2   15   4600         NaN